## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 5 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-09-15T18:50:46Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:507252742351:s50ry4jhg5/" -> (known after apply)
      ~ id                = "nz6j8a" -> (known after apply)
      ~ invoke_url        = "https://s50ry4jhg5.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ stage_description = "4b3271cd25d4390fbcb1dbee74fb1b0c" -> "04bfcb62df1c404d7aba1e9ad868a33e" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration_response.integration_response will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "integration_response" {
        id                  = "agir-s50ry4jhg5-mkxgh4-ANY-200"
      ~ response_parameters = {
          + "method.response.header.Strict-Transport-Security" = "max-age=300; includeSubDomains; preload"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.root_integration_response will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "root_integration_response" {
        id                  = "agir-s50ry4jhg5-hm85fkep2e-ANY-200"
      ~ response_parameters = {
          + "method.response.header.Strict-Transport-Security" = "max-age=300; includeSubDomains; preload"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.api_response_200 will be updated in-place
  ~ resource "aws_api_gateway_method_response" "api_response_200" {
        id                  = "agmr-s50ry4jhg5-mkxgh4-ANY-200"
      ~ response_parameters = {
          + "method.response.header.Strict-Transport-Security" = true
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_method_response.api_root_response_200 will be updated in-place
  ~ resource "aws_api_gateway_method_response" "api_root_response_200" {
        id                  = "agmr-s50ry4jhg5-hm85fkep2e-ANY-200"
      ~ response_parameters = {
          + "method.response.header.Strict-Transport-Security" = true
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      - cache_cluster_size    = "0.5" -> null
      ~ deployment_id         = "nz6j8a" -> (known after apply)
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>